Revit 2024 API
TextNode Class
 This class represents a text annotation object in a model-exporting process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class TextNode : RenderNode
Visual Basic
Public Class TextNode _
	Inherits RenderNode
Visual C++
public ref class TextNode : public RenderNode
Remarks
 See also: [!:Autodesk::Revit::DB::IModelExportContext::OnText].
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.TextNode
See Also
TextNode Members
Autodesk.Revit.DB Namespace